#Задача №_2 - Написать программу, которая приветствует пользователя, выводя сначала слово 'Hello'

name = input('Ведите имя: ') #Записываем введенные пользователем данные в переменную
greeting = 'Hello, ' + name + '!' #Формируем строку - результат в новой переменной

print(greeting)
