#Задача №_1 - написать программу, которая считывает три числа и выводит их сумму.

a = int(input('Введите число: ')) #
b = int(input('Введите число: ')) #Программа принимает от пользователя три числа
c = int(input('Введите число: ')) #

result = a + b + c #Результат сложения чисел, которые вводит пользователь

print(result)
